DataProcessors/Enums/ТипыПериодичностиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПериодичностиЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еженедельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПериодичностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОСобытииОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Catalogs/БазаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БазаЗнаний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформацииБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПароль</Name>
					<Comment>Используется только для ввода нового пароля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходРазрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/CommonModules/ТгБотКалендарь/Ext/Module.bsl
// Проверяет невыполненные задачи, отправляет напоминания и уведомления о наступлении срока в указанный чат Telegram
//
// Параметры:
//   ЧатID - <Тип> - идентификатор чата для отправки уведомлений
Процедура ПроверитьКалендарьИЗадачи(ЧатID) Экспорт
	ПользовательСсылка = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);
	Если ПользовательСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   Задачи.Ссылка,
	|   Задачи.Наименование КАК Текст,
	|   Задачи.ДатаИсполнения КАК ДатаСобытия,
	|   Задачи.Напоминание КАК Тип,
	|   Задачи.НапоминаниеОтправлено КАК БылоНапоминание,
	|   Задачи.УведомлениеОСобытииОтправлено КАК Уведомление
	|ИЗ
	|   Справочник.Задачи КАК Задачи
	|ГДЕ
	|   НЕ Задачи.Статус
	|   И Задачи.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПользовательСсылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    ТекВремя = ТекущаяДата();
    
    Пока Выборка.Следующий() Цикл       
        Если НЕ Выборка.БылоНапоминание Тогда
            СекундДо = ТгБотСервисы.ПолучитьСекундыИзТипаНапоминания(Выборка.Тип);
            ВремяНапоминания = Выборка.ДатаСобытия - СекундДо;
            
            Если ТекВремя >= ВремяНапоминания И ТекВремя < Выборка.ДатаСобытия Тогда
                ТекстУвед = " *СКОРО:* " + Выборка.Текст + " (" + Формат(Выборка.ДатаСобытия, "ДФ=HH:mm") + ")";
                ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстУвед);
                Объект = Выборка.Ссылка.ПолучитьОбъект();
                Объект.НапоминаниеОтправлено = Истина;
                Объект.Записать();
            КонецЕсли;
        КонецЕсли;
        Если НЕ Выборка.Уведомление Тогда
        Если ТекВремя >= Выборка.ДатаСобытия Тогда
            // Шлем финальное уведомление
            ТекстФИН = "⚠️ *ПОРА:* " + Выборка.Текст + "!" + Символы.ПС +
                       "Выполнить: /done_" + Выборка.Ссылка.Код + Символы.ПС +
                       "Отложить: /postpone_" + Выборка.Ссылка.Код;
            
            ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстФИН);
            
            Объект = Выборка.Ссылка.ПолучитьОбъект();
            Объект.УведомлениеОСобытииОтправлено = Истина;
		  Объект.Записать();
	  КонецЕсли;
	  КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры
// Отправляет напоминания пользователям о заметках базы знаний, созданных более 24 часов назад
Процедура ПроверитьНапоминанияБазыЗнаний() Экспорт
	
	Запрос = Новый Запрос;
	// Ищем заметки, созданные более 24 часов назад, о которых еще не напоминали
	Запрос.Текст = 
	"ВЫБРАТЬ

	|	База.Ссылка КАК Ссылка,
	|	База.Пользователь КАК Пользователь,
	|	База.ТипИнформации КАК Тип,

	|	База.Содержание КАК Текст
	|ИЗ
	|	Справочник.БазаЗнаний КАК База

	|ГДЕ
	|	НЕ База.НапоминаниеОтправлено
	|	И База.ДатаДобавления <= &ДатаСреза";
	
	// Напоминаем через 1 день (86400 секунд)
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата() - 86400);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    
    ЧатID = ТгБотСервисы.ОпределитьIDПоПользователю(Выборка.Пользователь);
    
    Если ЧатID = 0 Тогда       
	    Продолжить;
    КонецЕсли;

    Заголовок = " *Вспомни это:* " + Выборка.Тип;
    ТекстСообщения = Заголовок + Символы.ПС + "---------------------------" + Символы.ПС + Выборка.Текст;
    
    // Ищем, есть ли у этой заметки прикрепленный файл
    ЗапросФайла = Новый Запрос;
	ЗапросФайла.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ПрисоединенныеФайлыБазыЗнаний ГДЕ Владелец = &Владелец";
	ЗапросФайла.УстановитьПараметр("Владелец", Выборка.Ссылка);
	РезультатФайла = ЗапросФайла.Выполнить();

	Если НЕ РезультатФайла.Пустой() Тогда
    	ВыборкаФайла = РезультатФайла.Выбрать();
   	 ВыборкаФайла.Следующий();
   	 ФайлСсылка = ВыборкаФайла.Ссылка;
        
        ДвоичныеДанные = ФайлСсылка.Файл.Получить(); 
        ТгБотКлиент.ОтправитьФото(ЧатID, ДвоичныеДанные, ТекстСообщения);
    Иначе
        ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстСообщения); 
    КонецЕсли;
    
    // 4. Помечаем, что напомнили
    Объект = Выборка.Ссылка.ПолучитьОбъект();
    Объект.НапоминаниеОтправлено = Истина;
    Объект.Записать();
    
	КонецЦикла;
КонецПроцедуры

Функция  СформироватьКалендарь() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Задачи.ДатаИсполнения, ДЕНЬ) КАК День,
	|	Задачи.ДатаИсполнения КАК Время,
	|	Задачи.Наименование КАК Текст,
	|	Задачи.Статус КАК Выполнена
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.ДатаИсполнения МЕЖДУ &Начало И &Конец
	|УПОРЯДОЧИТЬ ПО
	|	День,
	|	Время";
	
	Запрос.УстановитьПараметр("Начало", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Конец",  КонецДня(ТекущаяДата() + 6 * 86400));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Текст = " На ближайшую неделю планов нет. Свобода! ";
		Возврат Текст;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Текст = " *ВАШ КАЛЕНДАРЬ НА 7 ДНЕЙ*" + Символы.ПС + "---------------------------" + Символы.ПС;
	
	ТекущийДень = Дата(1,1,1);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.День <> ТекущийДень Тогда
			ТекущийДень = Выборка.День;
			Текст = Текст + Символы.ПС + " *" + Формат(ТекущийДень, "ДФ='dd MMMM (ddd)'") + "*" + Символы.ПС;
		КонецЕсли;
		
		Иконка = ?(Выборка.Выполнена, "✅", "⏳");
		Текст = Текст + Иконка + " " + Формат(Выборка.Время, "ДФ=HH:mm") + " — " + Выборка.Текст + Символы.ПС;
		
	КонецЦикла;
	
	Возврат Текст;
КонецФункции

 //Получить список задач
 Функция ПолучитьСписокЗадачТг() Экспорт
	   Запрос = Новый Запрос;
	   Запрос.Текст=
	    "ВЫБРАТЬ
	    |	Задачи.Наименование КАК Текст,
	    |	Задачи.ДатаИсполнения КАК Дата,
	    |	Задачи.Описание КАК Описание
	    |ИЗ
	    |	Справочник.Задачи КАК Задачи
	    |ГДЕ
	    |	Задачи.Статус = Ложь
	    |УПОРЯДОЧИТЬ ПО
	    |   Задачи.ДатаИсполнения";
	   Выборка = Запрос.Выполнить().Выбрать();
	   
	   Если Выборка.Количество() = 0 Тогда
        		Возврат "У вас пока нет активных задач. Отдыхайте! ";
   	   КонецЕсли;
	   
	    Текст = " Список ваших задач:" + Символы.ПС + "---------------------------" + Символы.ПС;
	    Счетчик = 1;
	    Пока Выборка.Следующий() Цикл
		    Текст = Текст + Счетчик + ". " + Формат(Выборка.Дата, "ДФ='dd.MM HH:mm'") + " — " + Выборка.Текст + Символы.ПС + Выборка.Описание + Символы.ПС + Символы.ПС;
		    Счетчик = Счетчик + 1;
	    КонецЦикла;
   	
	   Возврат Текст;
 КонецФункции
 //Добавить задачу
 Функция ДобавитьЗадачуТг(ВходнаяСтрока, ЧатID = 0) Экспорт
	 ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	Если ЧатID > 0 Тогда
		ТекущийПользователь = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);
	КонецЕсли;
	 ПозЦифры = 0;
    Для НомерСимвола = 1 По СтрДлина(ВходнаяСтрока) Цикл
        КодСимвола = КодСимвола(Сред(ВходнаяСтрока, НомерСимвола, 1));
        Если КодСимвола >= 48 И КодСимвола <= 57 Тогда
            ПозЦифры = НомерСимвола;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Если ПозЦифры = 0 Тогда
        Текст = "❌ Ошибка! Не указана дата (нужны цифры).";
        Возврат Текст;
    КонецЕсли;
    
    // 2. Делим строку на "До" и "После"
    Название = СокрЛП(Лев(ВходнаяСтрока, ПозЦифры - 1));
    Параметры = СокрЛП(Сред(ВходнаяСтрока, ПозЦифры));
    
    МассивПарам = СтрРазделить(Параметры, " ");
    Если МассивПарам.Количество() < 4 Тогда
        Текст = "❌ Ошибка! Проверьте дату, время, тип напоминания и периодичность.";
        Возврат Текст;
    КонецЕсли;
    
    ДатаСтр = МассивПарам[0];
    ВремяСтр = МассивПарам[1];
    ТипСтр = МассивПарам[2];
    ПериодСтр = МассивПарам[3];
    // 4. Пытаемся записать в базу
    Попытка
        НоваяЗадача = Справочники.Задачи.СоздатьЭлемент();
        НоваяЗадача.Наименование = Название;
        
                Д = ДатаСтр; В = ВремяСтр;
        Стр1С = Прав(Д,4) + Сред(Д,4,2) + Лев(Д,2) + СтрЗаменить(В,":","") + "00";
        НоваяЗадача.ДатаИсполнения = Дата(Стр1С);
	   
        // Ищем значение перечисления по имени
        НоваяЗадача.Напоминание = Перечисления.ТипыНапоминаний[ТипСтр];
        НоваяЗадача.Периодичность = Перечисления.ТипыПериодичностиЗадач[ПериодСтр];
		НоваяЗадача.Пользователь = ТекущийПользователь;
		НоваяЗадача.Записать();
        Текст = "✅ Задача '" + Название + "' добавлена!";
	   Возврат Текст;
    Исключение
        Текст = "❌ Ошибка формата! Проверьте дату (ДД.ММ.ГГГГ) и Тип.";
    КонецПопытки;
	 
КонецФункции
//Выполнить задачу
Функция ВыполнитьЗадачуТг(ВходнаяСтрока) Экспорт
	ЗадачаСсылка = Справочники.Задачи.НайтиПоКоду(ВходнаяСтрока);
	Если НЕ ЗадачаСсылка.Пустая() Тогда
	Объект = ЗадачаСсылка.ПолучитьОбъект();
		Если Объект.Периодичность = Перечисления.ТипыПериодичностиЗадач.Нет Тогда
		Объект.Статус = Истина;
		Объект.НапоминаниеОтправлено = Истина;
		Объект.УведомлениеОСобытииОтправлено = Истина;
		Объект.Записать();
		 Текст = "✅ Задача '" + Объект.Наименование + "' выполнена!";
	 	ИначеЕсли Объект.Периодичность = Перечисления.ТипыПериодичностиЗадач.Ежедневно Тогда
		 Объект.ДатаИсполнения = Объект.ДатаИсполнения + 86400;
		 Объект.НапоминаниеОтправлено = Ложь;
		Объект.УведомлениеОСобытииОтправлено = Ложь;
		Текст = "✅ Задача '" + Объект.Наименование + "' выполнена!";
		 ИначеЕсли Объект.Периодичность = Перечисления.ТипыПериодичностиЗадач.Еженедельно Тогда
		 Объект.ДатаИсполнения = Объект.ДатаИсполнения + (7*86400);
		 Объект.НапоминаниеОтправлено = Ложь;
		Объект.УведомлениеОСобытииОтправлено = Ложь;
		Текст = "✅ Задача '" + Объект.Наименование + "' выполнена!";
		ИначеЕсли Объект.Периодичность = Перечисления.ТипыПериодичностиЗадач.Ежемесячно Тогда
		 Объект.ДатаИсполнения = ДобавитьМесяц(Объект.ДатаИсполнения, 1);
		 Объект.НапоминаниеОтправлено = Ложь;
		Объект.УведомлениеОСобытииОтправлено = Ложь;
		Текст = "✅ Задача '" + Объект.Наименование + "' выполнена!";
		Иначе
      	Текст = "❌ Ошибка: задача с кодом " + ВходнаяСтрока + " не найдена.";
	 	КонецЕсли;
	 КонецЕсли;
	 Возврат Текст;
 КонецФункции  
//Отложить задачу 
Функция ОтложитьЗадачуТг(ВходнаяСтрока) Экспорт
	  ЗадачаСсылка = Справочники.Задачи.НайтиПоКоду(ВходнаяСтрока);
	Если НЕ ЗадачаСсылка.Пустая() Тогда
		Объект = ЗадачаСсылка.ПолучитьОбъект();
		Объект.ДатаИсполнения = Объект.ДатаИсполнения + 86400;
		Объект.НапоминаниеОтправлено = Ложь;
        Объект.УведомлениеОСобытииОтправлено = Ложь;
        Объект.Записать();
        НовоеВремя = Формат(Объект.ДатаИсполнения, "ДФ='dd.MM.yyyy HH:mm'");
        Текст = "↩️ Задача '" + Объект.Наименование + "' отложена на завтра. " + Символы.ПС + "Новое время: " + НовоеВремя;
    Иначе
        Текст = "❌ Ошибка: задача не найдена.";
   КонецЕсли; 
   Возврат Текст;
КонецФункции

Процедура ПроверитьЗадачиВсехПользователей() Экспорт
	КоличествоПользователей = 0;
	КоличествоОшибок = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.ТелеграмID КАК ТелеграмID
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ВходРазрешен = Истина";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КоличествоПользователей = КоличествоПользователей + 1;
		ЧатID = Число(Выборка.ТелеграмID);
		Если ЧатID = 0 Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ПроверитьКалендарьИЗадачи(ЧатID);
			ПроверитьНапоминанияБазыЗнаний();
		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;
			ДопДанные = Новый Структура;
			ДопДанные.Вставить("Пользователь", Выборка.Пользователь);
			ДопДанные.Вставить("ЧатID", ЧатID);
			ДопДанные.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		СЛ_ЛогированиеСервер.Зафиксировать("ТГ.ОшибкаЗадач", 3, Выборка.Пользователь, ДопДанные);
		КонецПопытки;
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("ВсегоПользователей", КоличествоПользователей);
	Результат.Вставить("Ошибок", КоличествоОшибок);
	Результат.Вставить("ВремяВыполнения", ТекущаяДатаСеанса());
	СЛ_ЛогированиеСервер.Зафиксировать("ТГ.ПроверкаЗадач.Завершена", 1, , Результат);
КонецПроцедуры

Процедура ПроверитьЗадачиВсехПользователейРеалТайм() Экспорт
	ПроверитьЗадачиВсехПользователей();
	КонецПроцедуры
